ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/GPMC_GPMC_48400000h.xml
<module name="GPMC" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="GPMC_REVISION" acronym="GPMC_REVISION" offset="0" width="32" description="This register contains the IP revision code .">
		<bitfield id="RESERVED_230" width="24" begin="31" end="8" resetval="0x0" description="Reads returns 0" range="31:8" rwaccess="R"/>
	<bitfield id="REV" width="8" begin="7" end="0" resetval="0x96" description="IP revision[7:4]Major revision[3:0]Minor revisionExamples: 0x10 for 1.0, 0x21 for 2.1" range="7:0" rwaccess="R"/>
	</register><register id="GPMC_SYSSTATUS" acronym="GPMC_SYSSTATUS" offset="20" width="32" description="This register provides status information about the module, excluding the interrupt status information  ">
		<bitfield id="RESERVED_235" width="24" begin="31" end="8" resetval="0x0" description="Reads returns 0" range="31:8" rwaccess="R"/>
	<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="Reads returns 0 [reserved for OCP-socket status information]" range="7:1" rwaccess="R"/>
	<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="Internal reset monitoring 0      Internal module reset in on-going1      Reset completed" range="0" rwaccess="R"/>
	</register><register id="GPMC_IRQSTATUS" acronym="GPMC_IRQSTATUS" offset="24" width="32" description="This interrupt status register regroups all the status of the module internal events that can generate an interrupt. ">
		<bitfield id="RESERVED_218" width="20" begin="31" end="12" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:12" rwaccess="R"/>
	<bitfield id="WAIT3EDGEDETECTIONSTATUS" width="1" begin="11" end="11" resetval="0x0" description="Status of the Wait3 Edge Detection interrupt  0      Read 0: A transition on WAIT3 input pin has       not been detected0      Write 0: Wait3EdgeDetection status bit       unchanged1      Read 1: A transition on WAIT3 input pin has       been detected1      Write 1: Wait3EdgeDetection status bit is       reset" range="11" rwaccess="R/W1TC"/>
	<bitfield id="WAIT2EDGEDETECTIONSTATUS" width="1" begin="10" end="10" resetval="0x0" description="Status of the Wait2 Edge Detection interrupt  0      Read 0: A transition on WAIT2 input pin has       not been detected0      Write 0: Wait2EdgeDetection status bit       unchanged1      Read 1: A transition on WAIT2 input pin has       been detected1      Write 1: Wait2EdgeDetection status bit is       reset" range="10" rwaccess="R/W1TC"/>
	<bitfield id="WAIT1EDGEDETECTIONSTATUS" width="1" begin="9" end="9" resetval="0x0" description="Status of the Wait1 Edge Detection interrupt  0      Read 0: A transition on WAIT1 input pin has       not been detected0      Write 0: Wait1EdgeDetection status bit       unchanged1      Read 1: A transition on WAIT1 input pin has       been detected1      Write 1: Wait1EdgeDetection status bit is       reset" range="9" rwaccess="R/W1TC"/>
	<bitfield id="WAIT0EDGEDETECTIONSTATUS" width="1" begin="8" end="8" resetval="0x0" description="Status of the Wait0 Edge Detection interrupt  0      Read 0: A transition on WAIT0 input pin has       not been detected0      Write 0: Wait0EdgeDetection status bit       unchanged1      Read 1: A transition on WAIT0 input pin has       been detected1      Write 1: Wait0EdgeDetection status bit is       reset" range="8" rwaccess="R/W1TC"/>
	<bitfield id="RESERVED_219" width="6" begin="7" end="2" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="7:2" rwaccess="R"/>
	<bitfield id="TERMINALCOUNTSTATUS" width="1" begin="1" end="1" resetval="0x0" description="Status of the TerminalCountEvent interrupt  0      Read 0: Indicates that CountValue is       greater than 00      Write 0: TerminalCountEvent status bit       unchanged1      Read 1: Indicates that CountValue is equal       to 01      Write 1: TerminalCountEvent status bit is       reset" range="1" rwaccess="R/W1TC"/>
	<bitfield id="FIFOEVENTSTATUS" width="1" begin="0" end="0" resetval="0x0" description="Status of the FIFOEvent interrupt  0      Read 0: Indicates than less than       FIFOThreshold bytes are available in       prefetch mode and less than FIFOThreshold       bytes free places are available in write       posting mode.0      Write 0: FIFOEvent status bit unchanged1      Read 1: Indicates than at least       FIFOThreshold bytes are available in       prefetch mode and at least FIFOThreshold       bytes free places are available in write       posting mode.1      Write 1: FIFOEvent status bit is reset" range="0" rwaccess="R/W1TC"/>
	</register><register id="GPMC_IRQENABLE" acronym="GPMC_IRQENABLE" offset="28" width="32" description="The interrupt enable register allows to mask/unmask the module internal sources of interrupt, on a event-by-event basis. ">
		<bitfield id="RESERVED_216" width="20" begin="31" end="12" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:12" rwaccess="R"/>
	<bitfield id="WAIT3EDGEDETECTIONENABLE" width="1" begin="11" end="11" resetval="0x0" description="Enables the Wait3 Edge Detection interrupt 0      Wait3EdgeDetection interrupt is masked1      Wait3EdgeDetection event generates an       interrupt if occurs" range="11" rwaccess="R/W"/>
	<bitfield id="WAIT2EDGEDETECTIONENABLE" width="1" begin="10" end="10" resetval="0x0" description="Enables the Wait2 Edge Detection interrupt 0      Wait2EdgeDetection interrupt is masked1      Wait2EdgeDetection event generates an       interrupt if occurs" range="10" rwaccess="R/W"/>
	<bitfield id="WAIT1EDGEDETECTIONENABLE" width="1" begin="9" end="9" resetval="0x0" description="Enables the Wait1 Edge Detection interrupt 0      Wait1EdgeDetection interrupt is masked1      Wait1EdgeDetection event generates an       interrupt if occurs" range="9" rwaccess="R/W"/>
	<bitfield id="WAIT0EDGEDETECTIONENABLE" width="1" begin="8" end="8" resetval="0x0" description="Enables the Wait0 Edge Detection interrupt 0      Wait0EdgeDetection interrupt is masked1      Wait0EdgeDetection event generates an       interrupt if occurs" range="8" rwaccess="R/W"/>
	<bitfield id="RESERVED_217" width="6" begin="7" end="2" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="7:2" rwaccess="R"/>
	<bitfield id="TERMINALCOUNTEVENTENABLE" width="1" begin="1" end="1" resetval="0x0" description="Enables TerminalCountEvent interrupt issuing in pre-fetch or write posting mode 0      TerminalCountEvent interrupt is masked1      TerminalCountEvent interrupt is not masked" range="1" rwaccess="R/W"/>
	<bitfield id="FIFOEVENTENABLE" width="1" begin="0" end="0" resetval="0x0" description="Enables the FIFOEvent interrupt 0      FIFOEvent interrupt is masked1      FIFOEvent interrupt is not masked" range="0" rwaccess="R/W"/>
	</register><register id="GPMC_TIMEOUT_CONTROL" acronym="GPMC_TIMEOUT_CONTROL" offset="64" width="32" description="The GPMC_TIMEOUT_CONTROL register allows the user to set the start value of the timeout counter  ">
		<bitfield id="RESERVED_237" width="19" begin="31" end="13" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:13" rwaccess="R"/>
	<bitfield id="TIMEOUTSTARTVALUE" width="9" begin="12" end="4" resetval="0x511" description="Start value of the time-out counter [0x000 corresponds to 0 GPMC.FCLK cycle, 0x001 corresponds to 1 GmpcClk cycle,  &#38;, 0x1FF corresponds to 511  GPMC.FCLK cyles.]" range="12:4" rwaccess="R/W"/>
	<bitfield id="RESERVED_238" width="3" begin="3" end="1" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="3:1" rwaccess="R"/>
	<bitfield id="TIMEOUTENABLE" width="1" begin="0" end="0" resetval="0x0" description="Enable bit of the TimeOut feature 0      TimeOut feature is disabled1      TimeOut feature is enabled" range="0" rwaccess="R/W"/>
	</register><register id="GPMC_ERR_ADDRESS" acronym="GPMC_ERR_ADDRESS" offset="68" width="32" description="The GPMC_ERR_ADDRESS register stores the address of the illegal access when an error occurs .">
		<bitfield id="RESERVED_212" width="1" begin="31" end="31" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31" rwaccess="R"/>
	<bitfield id="ILLEGALADD" width="31" begin="30" end="0" resetval="0x0" description="Address of illegal access : A30[0 for memory region, 1 for GPMC register region] and A29-A0[1 GBytes maximum]" range="30:0" rwaccess="R"/>
	</register><register id="GPMC_ERR_TYPE" acronym="GPMC_ERR_TYPE" offset="72" width="32" description="The GPMC_ERR_TYPE register stores the type of error when an error occurs .">
		<bitfield id="RESERVED_215" width="21" begin="31" end="11" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:11" rwaccess="R"/>
	<bitfield id="ILLEGALMCMD" width="3" begin="10" end="8" resetval="0x0" description="System Command of the transaction that caused the error" range="10:8" rwaccess="R"/>
	<bitfield id="RESERVED_213" width="3" begin="7" end="5" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="7:5" rwaccess="R"/>
	<bitfield id="ERRORNOTSUPPADD" width="1" begin="4" end="4" resetval="0x0" description="Not supported Address error 0      No error occurs1      The error is due to a non supported Address" range="4" rwaccess="R"/>
	<bitfield id="ERRORNOTSUPPMCMD" width="1" begin="3" end="3" resetval="0x0" description="Not supported Command error 0      No error occurs1      The error is due to a non supported Command" range="3" rwaccess="R"/>
	<bitfield id="ERRORTIMEOUT" width="1" begin="2" end="2" resetval="0x0" description="Time-out error 0      No error occurs1      The error is due to a time out" range="2" rwaccess="R"/>
	<bitfield id="RESERVED_214" width="1" begin="1" end="1" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="1" rwaccess="R"/>
	<bitfield id="ERRORVALID" width="1" begin="0" end="0" resetval="0x0" description="Error validity status - Must be explicitely cleared with a write 1 transaction 0      All error fields no longer valid1      Error detected and logged in the other       error fields" range="0" rwaccess="R/W1TC"/>
	</register><register id="GPMC_CONFIG" acronym="GPMC_CONFIG" offset="80" width="32" description="The  configuration register allows global configuration of the GPMC .">
		<bitfield id="RESERVED_1" width="20" begin="31" end="12" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:12" rwaccess="R"/>
	<bitfield id="WAIT3PINPOLARITY" width="1" begin="11" end="11" resetval="0x1" description="Selects the polarity of input pin WAIT3 0      WAIT3 active low1      WAIT3 active high" range="11" rwaccess="R/W"/>
	<bitfield id="WAIT2PINPOLARITY" width="1" begin="10" end="10" resetval="0x0" description="Selects the polarity of input pin WAIT2 0      WAIT2 active low1      WAIT2 active high" range="10" rwaccess="R/W"/>
	<bitfield id="WAIT1PINPOLARITY" width="1" begin="9" end="9" resetval="0x1" description="Selects the polarity of input pin WAIT1 0      WAIT1 active low1      WAIT1 active high" range="9" rwaccess="R/W"/>
	<bitfield id="WAIT0PINPOLARITY" width="1" begin="8" end="8" resetval="0x0" description="Selects the polarity of input pin WAIT0 0      WAIT0 active low1      WAIT0 active high" range="8" rwaccess="R/W"/>
	<bitfield id="RESERVED_0" width="3" begin="7" end="5" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="7:5" rwaccess="R"/>
	<bitfield id="WRITEPROTECT" width="1" begin="4" end="4" resetval="0x0" description="Controls the WP output pin level 0      WP output pin is low1      WP output pin is high" range="4" rwaccess="R/W"/>
	<bitfield id="RESERVED_2" width="2" begin="3" end="2" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="3:2" rwaccess="R"/>
	<bitfield id="LIMITEDADDRESS" width="1" begin="1" end="1" resetval="0x0" description="Limited Address device support 0      No effect1      A26-A11 are not modified during an external       memory access." range="1" rwaccess="R/W"/>
	<bitfield id="NANDFORCEPOSTEDWRITE" width="1" begin="0" end="0" resetval="0x0" description="Enables the Force Posted Write feature to NAND Cmd/Add/Data location 0      Disables  Force Posted Write1      Enables Force Posted Write" range="0" rwaccess="R/W"/>
	</register><register id="GPMC_STATUS" acronym="GPMC_STATUS" offset="84" width="32" description="The  status register provides global status bits of the GPMC .">
		<bitfield id="RESERVED_231" width="20" begin="31" end="12" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:12" rwaccess="R"/>
	<bitfield id="WAIT3STATUS" width="1" begin="11" end="11" resetval="0x0" description="Is a copy of input pin WAIT3. [Reset value is WAIT3 input pin sampled at IC reset] 0      WAIT3 de-asserted1      WAIT3 asserted" range="11" rwaccess="R"/>
	<bitfield id="WAIT2STATUS" width="1" begin="10" end="10" resetval="0x0" description="Is a copy of input pin WAIT2. [Reset value is WAIT2 input pin sampled at IC reset] 0      WAIT2 de-asserted1      WAIT2 asserted" range="10" rwaccess="R"/>
	<bitfield id="WAIT1STATUS" width="1" begin="9" end="9" resetval="0x0" description="Is a copy of input pin WAIT1. [Reset value is WAIT1 input pin sampled at IC reset] 0      WAIT1 de-asserted1      WAIT1 asserted" range="9" rwaccess="R"/>
	<bitfield id="WAIT0STATUS" width="1" begin="8" end="8" resetval="0x0" description="Is a copy of input pin WAIT0. [Reset value is WAIT0 input pin sampled at IC reset] 0      WAIT0 de-asserted1      WAIT0 asserted" range="8" rwaccess="R"/>
	<bitfield id="RESERVED_232" width="7" begin="7" end="1" resetval="0x0" description="Write 0's for future compatibility Reads returns 0" range="7:1" rwaccess="R"/>
	<bitfield id="EMPTYWRITEBUFFERSTATUS" width="1" begin="0" end="0" resetval="0x1" description="Stores the empty status of the write buffer 0      Write Buffer is not empty1      Write Buffer is empty" range="0" rwaccess="R"/>
	</register><register id="GPMC_PREFETCH_CONFIG1" acronym="GPMC_PREFETCH_CONFIG1" offset="480" width="32" description="Prefetch engine configuration 1 .">
		<bitfield id="RESERVED_221" width="1" begin="31" end="31" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31" rwaccess="R"/>
	<bitfield id="CYCLEOPTIMIZATION" width="3" begin="30" end="28" resetval="0x0" description="Define the number of GPMC.FCLK cycles to be substracted from RdCycleTime, WrCycleTime,  AccessTime, CSRdOffTime, CSWrOffTime, ADVRdOffTime, ADVWrOffTime, OEOffTime, WEOffTime [0x0 corresponds to 0 GPMC.FCLK cycle, 0x1 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x7 corresponds to 7 GPMC.FCLK cycles]" range="30:28" rwaccess="R/W"/>
	<bitfield id="ENABLEOPTIMIZEDACCESS" width="1" begin="27" end="27" resetval="0x0" description="Enables access cycle optimization 0      Access cycle optimization is disabled1      Access cycle optimization is enabled" range="27" rwaccess="R/W"/>
	<bitfield id="ENGINECSSELECTOR" width="3" begin="26" end="24" resetval="0x0" description="Selects the CS where Prefetch Postwrite engine is active [0x0 corresponds toCS0, 0x1 corresponds to CS1,  &#38;, 0x7 corresponds to CS7]" range="26:24" rwaccess="R/W"/>
	<bitfield id="PFPWENROUNDROBIN" width="1" begin="23" end="23" resetval="0x0" description="Enables the PFPW RoundRobin arbitration 0      Prefetch Postwrite engine round robin       arbitration  is disabled1      Prefetch Postwrite engine round robin       arbitration is enabled" range="23" rwaccess="R/W"/>
	<bitfield id="RESERVED_224" width="3" begin="22" end="20" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="22:20" rwaccess="R"/>
	<bitfield id="PFPWWEIGHTEDPRIO" width="4" begin="19" end="16" resetval="0x0" description="When an arbitration occurs between a direct memory access and a PFPW engine access, the direct memory access is always serviced. If the PFPWEnRoundRobin is enabled, 0x0 means : the next access is granted to the PFPW engine, 0x1 means : the two next accesses are granted to the PFPW engine, ..., 0xF means : the 16 next accesses are granted to the PFPW engine." range="19:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_220" width="1" begin="15" end="15" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="15" rwaccess="R"/>
	<bitfield id="FIFOTHRESHOLD" width="7" begin="14" end="8" resetval="0x64" description="Selects the maximum number of bytes read from the FIFO or written to the FIFO by the host on a DMA or interrupt request [0x00 corresponds to 0 byte, 0x01 corresponds to 1 byte,  &#38;, 0x40 corresponds to 64 bytes]" range="14:8" rwaccess="R/W"/>
	<bitfield id="ENABLEENGINE" width="1" begin="7" end="7" resetval="0x0" description="Enables the Prefetch Postwite engine 0      Prefetch Postwrite engine is disabled1      Prefetch Postwrite engine is enabled" range="7" rwaccess="R/W"/>
	<bitfield id="RESERVED_223" width="1" begin="6" end="6" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="6" rwaccess="R"/>
	<bitfield id="WAITPINSELECTOR" width="2" begin="5" end="4" resetval="0x0" description="Select which wait pin edge detector should start the engine in synchronized mode 0      Selects Wait0EdgeDetection1      Selects Wait1EdgeDetection2      Selects Wait2EdgeDetection3      Selects Wait3EdgeDetection" range="5:4" rwaccess="R/W"/>
	<bitfield id="SYNCHROMODE" width="1" begin="3" end="3" resetval="0x0" description="Selects when the engine starts the access to CS 0      Engine starts the access to CS as soon as       StartEngine is set1      Engine starts the access to CS as soon as       StartEngine is set AND wait to non wait       edge detection on the selected wait pin" range="3" rwaccess="R/W"/>
	<bitfield id="DMAMODE" width="1" begin="2" end="2" resetval="0x0" description="Selects interrupt synchronization or DMA request synchronization 0      Interrupt synchronization is enabled. Only       interrupt line will be activated on FIFO       threshold crossing.1      DMA request synchronization is enabled.A       DMA request protocol is used." range="2" rwaccess="R/W"/>
	<bitfield id="RESERVED_222" width="1" begin="1" end="1" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="1" rwaccess="R/W"/>
	<bitfield id="ACCESSMODE" width="1" begin="0" end="0" resetval="0x0" description="Selects pre-fetch read or write posting accesses 0      Pre-fetch read mode1      Write posting mode" range="0" rwaccess="R/W"/>
	</register><register id="GPMC_PREFETCH_CONFIG2" acronym="GPMC_PREFETCH_CONFIG2" offset="484" width="32" description="Prefetch engine configuration 2 .">
		<bitfield id="RESERVED_224" width="18" begin="31" end="14" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:14" rwaccess="R"/>
	<bitfield id="TRANSFERCOUNT" width="14" begin="13" end="0" resetval="0x0" description="Selects the number of bytes to be read or written by the engine to the selected CS  [0x0000 corresponds to 0 byte, 0x0001 corresponds to 1 byte,  &#38;, 0x2000 corresponds to 8 Kbytes]" range="13:0" rwaccess="R/W"/>
	</register><register id="GPMC_PREFETCH_CONTROL" acronym="GPMC_PREFETCH_CONTROL" offset="492" width="32" description="Prefetch engine control .">
		<bitfield id="RESERVED_225" width="31" begin="31" end="1" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:1" rwaccess="R"/>
	<bitfield id="STARTENGINE" width="1" begin="0" end="0" resetval="0x0" description="Resets the FIFO pointer and starts the engine 0      Write 0 stops the engine Read 0: engine is       stopped1      Write 1 resets the FIFO pointer to 0x0 in       prefetch mode and 0x40 in postwrite mode       and starts the engine. Read 1: engine is       running" range="0" rwaccess="R/W"/>
	</register><register id="GPMC_PREFETCH_STATUS" acronym="GPMC_PREFETCH_STATUS" offset="496" width="32" description="Prefetch engine status .">
		<bitfield id="RESERVED_227" width="1" begin="31" end="31" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31" rwaccess="R"/>
	<bitfield id="FIFOPOINTER" width="7" begin="30" end="24" resetval="0x0" description="Number of available bytes to be read or number of free empty byte places to be written [0x00 corresponds to 0 byte available to be read or 0 free empty place to be written,  &#38;, 0x40 corresponds to 64 bytes available to be read or 64 empty places to be written]" range="30:24" rwaccess="R"/>
	<bitfield id="RESERVED_228" width="7" begin="23" end="17" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="23:17" rwaccess="R"/>
	<bitfield id="FIFOTHRESHOLDSTATUS" width="1" begin="16" end="16" resetval="0x0" description="Set when FIFOPointer exceeds FIFOThreshold value 0      FIFOPointer smaller or equal to       FIFOThreshold. Writing to this bit has no       effect1      FIFOPointer greater than FIFOThreshold.       Writing to this bit has no effect" range="16" rwaccess="R"/>
	<bitfield id="RESERVED_226" width="2" begin="15" end="14" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="15:14" rwaccess="R"/>
	<bitfield id="COUNTVALUE" width="14" begin="13" end="0" resetval="0x0" description="Number of remaining bytes to be read or to be written by the engine according to the TransferCount value [0x0000 corresponds to 0 byte remaining to be read or to be written, 0x0001 corresponds to 1 byte remaining to be read or to be written,  &#38;, 0x2000 corresponds to 8 Kbytes remaining to be read or to be written]" range="13:0" rwaccess="R"/>
	</register><register id="GPMC_ECC_CONFIG" acronym="GPMC_ECC_CONFIG" offset="500" width="32" description="ECC configuration .">
		<bitfield id="RESERVED_206" width="15" begin="31" end="17" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:17" rwaccess="R"/>
	<bitfield id="ECCALGORITHM" width="1" begin="16" end="16" resetval="0x0" description="ECC algorithm used0x0: Hamming code0x1: BCH code" range="16" rwaccess="R/W"/>
	<bitfield id="RESERVED_205" width="2" begin="15" end="14" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="15:14" rwaccess="R"/>
	<bitfield id="ECCBCHTSEL" width="2" begin="13" end="12" resetval="0x1" description="Error correction capability used for BCH0x0: up to 4 bits error correction [t = 4]0x1: up to 8 bits error correction [t=8]0x2: up to 16 bits error correction [t=16]0x3: reserved" range="13:12" rwaccess="R/W"/>
	<bitfield id="ECCWRAPMODE" width="4" begin="11" end="8" resetval="0x0" description="Spare area organization definition for the BCH algorithm. See the BCH syndrome/parity calculator module functional specification for more details" range="11:8" rwaccess="R/W"/>
	<bitfield id="ECC16B" width="1" begin="7" end="7" resetval="0x0" description="Selects an ECC calculated on 16 columns 0      ECC calculated on 8 columns1      ECC calculated on 16 columns" range="7" rwaccess="R/W"/>
	<bitfield id="ECCTOPSECTOR" width="3" begin="6" end="4" resetval="0x3" description="Number of sectors to process with the BCH algorithm0x0: 1 sector [512kB page]0x1: 2 sectors...0x3: 4 sectors [2kB page]...0x7: 8 sectors [4kB page]" range="6:4" rwaccess="R/W"/>
	<bitfield id="ECCCS" width="3" begin="3" end="1" resetval="0x0" description="Selects the CS where ECC is computed 0      Chip select 01      Chip select 12      Chip select 23      Chip select 34      Chip select 45      Chip select 56      Chip select 67      Chip select 7" range="3:1" rwaccess="R/W"/>
	<bitfield id="ECCENABLE" width="1" begin="0" end="0" resetval="0x0" description="Enables the ECC feature 0      ECC disabled1      ECC enabled" range="0" rwaccess="R/W"/>
