ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/GPMC_GPMC_48400000h.xml
	</register><register id="GPMC_ECC_CONTROL" acronym="GPMC_ECC_CONTROL" offset="504" width="32" description="ECC control .">
		<bitfield id="RESERVED_207" width="23" begin="31" end="9" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:9" rwaccess="R"/>
	<bitfield id="ECCCLEAR" width="1" begin="8" end="8" resetval="0x0" description="Clear all ECC result registers [Reads returns 0 - Writes 1 to this field clear all ECC result registers - Writes 0 are ignored] " range="8" rwaccess="R/W1TC"/>
	<bitfield id="RESERVED_208" width="4" begin="7" end="4" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="7:4" rwaccess="R"/>
	<bitfield id="ECCPOINTER" width="4" begin="3" end="0" resetval="0x0" description="Selects ECC result register [Reads to this field give the dynamic position of the ECC pointer - Writes to this field select the ECC result register where the first ECC computation will be stored]; Other enums: Writing other values disables the ECC engine [ECCEnable bit of GPMC_ECC_CONFIG set to 0] 0      writing 0000 disables the ECC engine       (ECCEnable bit of GPMC_ECC_CONFIG set to 0)1      ECC result register 1 is selected2      ECC result register 2 is selected3      ECC result register 3 is selected4      ECC result register 4 is selected5      ECC result register 5 is selected6      ECC result register 6 is selected7      ECC result register 7 is selected8      ECC result register 8 is selected9      ECC result register 9 is selected" range="3:0" rwaccess="R/W"/>
	</register><register id="GPMC_ECC_SIZE_CONFIG" acronym="GPMC_ECC_SIZE_CONFIG" offset="508" width="32" description="ECC size .">
		<bitfield id="RESERVED_210" width="2" begin="31" end="30" resetval="0x3" description="Write 0's for future compatibility. Read returns 3" range="31:30" rwaccess="R/W"/>
	<bitfield id="ECCSIZE1" width="8" begin="29" end="22" resetval="0x255" description="Defines ECC size 1 [0x00 corresponds to 2 Bytes, 0x01 corresponds to 4 Bytes, 0x02 corresponds to 6 Bytes, 0x03 corresponds to 8 Bytes,  &#38;, 0xFF corresponds to 512 Bytes]" range="29:22" rwaccess="R/W"/>
	<bitfield id="RESERVED_211" width="2" begin="21" end="20" resetval="0x3" description="Write 0's for future compatibility. Read returns 3" range="21:20" rwaccess="R/W"/>
	<bitfield id="ECCSIZE0" width="8" begin="19" end="12" resetval="0x255" description="Defines ECC size 0 [0x00 corresponds to 2 Bytes, 0x01 corresponds to 4 Bytes, 0x02 corresponds to 6 Bytes, 0x03 corresponds to 8 Bytes,  &#38;, 0xFF corresponds to 512 Bytes]" range="19:12" rwaccess="R/W"/>
	<bitfield id="RESERVED_209" width="3" begin="11" end="9" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="11:9" rwaccess="R"/>
	<bitfield id="ECC9RESULTSIZE" width="1" begin="8" end="8" resetval="0x0" description="Selects ECC size for ECC 9 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="8" rwaccess="R/W"/>
	<bitfield id="ECC8RESULTSIZE" width="1" begin="7" end="7" resetval="0x0" description="Selects ECC size for ECC 8 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="7" rwaccess="R/W"/>
	<bitfield id="ECC7RESULTSIZE" width="1" begin="6" end="6" resetval="0x0" description="Selects ECC size for ECC 7 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="6" rwaccess="R/W"/>
	<bitfield id="ECC6RESULTSIZE" width="1" begin="5" end="5" resetval="0x0" description="Selects ECC size for ECC 6 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="5" rwaccess="R/W"/>
	<bitfield id="ECC5RESULTSIZE" width="1" begin="4" end="4" resetval="0x0" description="Selects ECC size for ECC 5 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="4" rwaccess="R/W"/>
	<bitfield id="ECC4RESULTSIZE" width="1" begin="3" end="3" resetval="0x0" description="Selects ECC size for ECC 4 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="3" rwaccess="R/W"/>
	<bitfield id="ECC3RESULTSIZE" width="1" begin="2" end="2" resetval="0x0" description="Selects ECC size for ECC 3 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="2" rwaccess="R/W"/>
	<bitfield id="ECC2RESULTSIZE" width="1" begin="1" end="1" resetval="0x0" description="Selects ECC size for ECC 2 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="1" rwaccess="R/W"/>
	<bitfield id="ECC1RESULTSIZE" width="1" begin="0" end="0" resetval="0x0" description="Selects ECC size for ECC 1 result register 0      ECCSize0 is selected1      ECCSize1 is selected" range="0" rwaccess="R/W"/>
	</register><register id="GPMC_ECC_RESULT_j" acronym="GPMC_ECC_RESULT_j" offset="512" width="32" description="ECC result register .">
		<bitfield id="RESERVED_188" width="4" begin="31" end="28" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:28" rwaccess="R"/>
	<bitfield id="P2048O" width="1" begin="27" end="27" resetval="0x0" description="Odd Row Parity bit2048 only used for ECC computed on 512 Bytes " range="27" rwaccess="R"/>
	<bitfield id="P1024O" width="1" begin="26" end="26" resetval="0x0" description="Odd Row Parity bit 1024" range="26" rwaccess="R"/>
	<bitfield id="P512O" width="1" begin="25" end="25" resetval="0x0" description="Odd Row Parity bit 512" range="25" rwaccess="R"/>
	<bitfield id="P256O" width="1" begin="24" end="24" resetval="0x0" description="Odd Row Parity bit 256" range="24" rwaccess="R"/>
	<bitfield id="P128O" width="1" begin="23" end="23" resetval="0x0" description="Odd Row Parity bit 128" range="23" rwaccess="R"/>
	<bitfield id="P64O" width="1" begin="22" end="22" resetval="0x0" description="Odd Row Parity bit 64" range="22" rwaccess="R"/>
	<bitfield id="P32O" width="1" begin="21" end="21" resetval="0x0" description="Odd Row Parity bit 32" range="21" rwaccess="R"/>
	<bitfield id="P16O" width="1" begin="20" end="20" resetval="0x0" description="Odd Row Parity bit 16" range="20" rwaccess="R"/>
	<bitfield id="P8O" width="1" begin="19" end="19" resetval="0x0" description="Odd Row Parity bit 8" range="19" rwaccess="R"/>
	<bitfield id="P4O" width="1" begin="18" end="18" resetval="0x0" description="Odd Column Parity bit 4" range="18" rwaccess="R"/>
	<bitfield id="P2O" width="1" begin="17" end="17" resetval="0x0" description="Odd Column Parity bit 2" range="17" rwaccess="R"/>
	<bitfield id="P1O" width="1" begin="16" end="16" resetval="0x0" description="Odd Column Parity bit 1" range="16" rwaccess="R"/>
	<bitfield id="RESERVED_187" width="4" begin="15" end="12" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="15:12" rwaccess="R"/>
	<bitfield id="P2048E" width="1" begin="11" end="11" resetval="0x0" description="Even Row Parity bit2048 only used for ECC computed on 512 Bytes " range="11" rwaccess="R"/>
	<bitfield id="P1024E" width="1" begin="10" end="10" resetval="0x0" description="Even Row Parity bit 1024" range="10" rwaccess="R"/>
	<bitfield id="P512E" width="1" begin="9" end="9" resetval="0x0" description="Even Row Parity bit 512" range="9" rwaccess="R"/>
	<bitfield id="P256E" width="1" begin="8" end="8" resetval="0x0" description="Even Row Parity bit 256" range="8" rwaccess="R"/>
	<bitfield id="P128E" width="1" begin="7" end="7" resetval="0x0" description="Even Row Parity bit 128" range="7" rwaccess="R"/>
	<bitfield id="P64E" width="1" begin="6" end="6" resetval="0x0" description="Even Row Parity bit 64" range="6" rwaccess="R"/>
	<bitfield id="P32E" width="1" begin="5" end="5" resetval="0x0" description="Even Row Parity bit 32" range="5" rwaccess="R"/>
	<bitfield id="P16E" width="1" begin="4" end="4" resetval="0x0" description="Even Row Parity bit 16" range="4" rwaccess="R"/>
	<bitfield id="P8E" width="1" begin="3" end="3" resetval="0x0" description="Even Row Parity bit 8" range="3" rwaccess="R"/>
	<bitfield id="P4E" width="1" begin="2" end="2" resetval="0x0" description="Even Column Parity bit 4" range="2" rwaccess="R"/>
	<bitfield id="P2E" width="1" begin="1" end="1" resetval="0x0" description="Even Column Parity bit 2" range="1" rwaccess="R"/>
	<bitfield id="P1E" width="1" begin="0" end="0" resetval="0x0" description="Even Column Parity bit 1" range="0" rwaccess="R"/>
	</register><register id="GPMC_BCH_SWDATA" acronym="GPMC_BCH_SWDATA" offset="720" width="32" description="This register is used to directly pass data to the BCH ECC calculator without accessing the actual NAND flash interface.">
		<bitfield id="BCH_DATA" width="16" begin="15" end="0" resetval="0x0" description="Data to be included in the BCH calculation. Only bits 0 to 7 are taken into account if the calculator is configured to use 8 bits data [ECC16B = 0]" range="15:0" rwaccess="W"/>
	</register><register id="GPMC_CONFIG1_j" acronym="GPMC_CONFIG1_j" offset="96" width="32" description="The  configuration 1 register sets signal control parameters per chip select ">
		<bitfield id="WRAPBURST" width="1" begin="31" end="31" resetval="0x0" description="Enables the wrapping burst capability. Must be set if the attached device is configured in wrapping burst 0      Synchronous wrapping burst not supported1      Synchronous wrapping burst supported" range="31" rwaccess="R/W"/>
	<bitfield id="READMULTIPLE" width="1" begin="30" end="30" resetval="0x0" description="Selects the read single or multiple access 0      single access1      multiple access (burst if synchonous, page       if asynchronous)" range="30" rwaccess="R/W"/>
	<bitfield id="READTYPE" width="1" begin="29" end="29" resetval="0x0" description="Selects the read mode operation 0      Read Asynchronous1      Read Synchronous" range="29" rwaccess="R/W"/>
	<bitfield id="WRITEMULTIPLE" width="1" begin="28" end="28" resetval="0x0" description="Selects the write single or multiple access 0      single access1      multiple access (burst if synchonous,       considered as single if asynchronous)" range="28" rwaccess="R/W"/>
	<bitfield id="WRITETYPE" width="1" begin="27" end="27" resetval="0x0" description="Selects the write mode operation 0      Write Asynchronous1      Write Synchronous" range="27" rwaccess="R/W"/>
	<bitfield id="CLKACTIVATIONTIME" width="2" begin="26" end="25" resetval="0x0" description="Output GPMC.CLK activation time 0      First rising edge of GPMC.CLK at Start       Access Time1      First rising edge of GPMC.CLK one GPMC.FCLK       cycle after Start Access Time2      First rising edge of GPMC.CLK two GPMC.FCLK       cycles after Start Access Time3      not defined" range="26:25" rwaccess="R/W"/>
	<bitfield id="ATTACHEDDEVICEPAGELENGTH" width="2" begin="24" end="23" resetval="0x0" description="Specifies the attached device page [burst] length 0      4 Words1      8 Words2      16 Words3      32 Words" range="24:23" rwaccess="R/W"/>
	<bitfield id="WAITREADMONITORING" width="1" begin="22" end="22" resetval="0x0" description="Selects the Wait monitoring configuration for Read accesses [Reset value is BOOTWAITEN input pin sampled at IC reset] 0      Wait pin is not monitored for read accesses1      Wait pin is monitored for read accesses" range="22" rwaccess="R/W"/>
	<bitfield id="WAITWRITEMONITORING" width="1" begin="21" end="21" resetval="0x0" description="Selects the Wait monitoring configuration for Write accesses 0      Wait pin is not monitored for write       accesses1      Wait pin is monitored for write accesses" range="21" rwaccess="R/W"/>
	<bitfield id="RESERVED_9" width="1" begin="20" end="20" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="20" rwaccess="R"/>
	<bitfield id="WAITMONITORINGTIME" width="2" begin="19" end="18" resetval="0x0" description="Selects input pin Wait monitoring time 0      Wait pin is monitored with valid data1      Wait pin is monitored one GPMC.CLK cycle       before valid data2      Wait pin is monitored two GPMC.CLK cycle       before valid data3      not defined" range="19:18" rwaccess="R/W"/>
	<bitfield id="WAITPINSELECT" width="2" begin="17" end="16" resetval="0x0" description="Selects the input WAIT pin for this chip select [Reset value is BOOTWAITSELECT input pin sampled at IC reset for CS0 and 0 for CS1-7] 0      Wait input pin is WAIT01      Wait input pin is WAIT12      Wait input pin is WAIT23      Wait input pin is WAIT3" range="17:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_11" width="2" begin="15" end="14" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="15:14" rwaccess="R"/>
	<bitfield id="DEVICESIZE" width="2" begin="13" end="12" resetval="0x0" description="Selects the device size attached [Reset value is BOOTDEVICESIZE input pin sampled at IC reset for CS0 and 01 for CS1-7] 0      8 bit1      16 bit2      32 bit3      reserved" range="13:12" rwaccess="R/W"/>
	<bitfield id="DEVICETYPE" width="2" begin="11" end="10" resetval="0x0" description="Selects the attached device type 0      NOR Flash, pSRAM, asynchronous devices1      reserved2      NAND Flash stream mode3      reserved" range="11:10" rwaccess="R/W"/>
	<bitfield id="MUXADDDATA" width="2" begin="9" end="8" resetval="0x0" description="Enables the Address and data multiplexed protocol   [Reset value is CS0MUXDEVICE input pin sampled at IC reset for CS0 and 0 for CS1-7] 0      Non Multiplexed attached device1      AAD-Mux protocol device2      Address and data multiplexed attached       device3      Reserved" range="9:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_12" width="3" begin="7" end="5" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="7:5" rwaccess="R"/>
	<bitfield id="TIMEPARAGRANULARITY" width="1" begin="4" end="4" resetval="0x0" description="Signals timing latencies scalar factor [Rd/WRCycleTime, AccessTime, PageBurstAccessTime, CSOnTime, CSRd/WrOffTime, ADVOnTime, ADVRd/WrOffTime, OEOnTime, OEOffTime, WEOnTime, WEOffTime, Cycle2CycleDelay, BusTurnAround, TimeOutStartValue] 0      x1 latencies1      x2 latencies" range="4" rwaccess="R/W"/>
	<bitfield id="RESERVED_10" width="2" begin="3" end="2" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="3:2" rwaccess="R"/>
	<bitfield id="GPMCFCLKDIVIDER" width="2" begin="1" end="0" resetval="0x0" description="Divides the GPMC.FCLK clock 0      GPMC.CLK frequency = GPMC.FCLK frequency1      GPMC.CLK frequency = GPMC.FCLK frequency /       22      GPMC.CLK frequency = GPMC.FCLK frequency /       33      GPMC.CLK frequency = GPMC.FCLK frequency /4" range="1:0" rwaccess="R/W"/>
	</register><register id="GPMC_CONFIG2_j" acronym="GPMC_CONFIG2_j" offset="100" width="32" description="Chip-select signal timing parameter configuration ">
		<bitfield id="RESERVED_43" width="11" begin="31" end="21" resetval="0x0" description="Write 0's for future compatibility Reads returns 0" range="31:21" rwaccess="R"/>
	<bitfield id="CSWROFFTIME" width="5" begin="20" end="16" resetval="0x16" description="CS# de-assertion time from start cycle time for write accesses [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="20:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_45" width="3" begin="15" end="13" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="15:13" rwaccess="R"/>
	<bitfield id="CSRDOFFTIME" width="5" begin="12" end="8" resetval="0x16" description="CS# de-assertion time from start cycle time for read accesses [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="12:8" rwaccess="R/W"/>
	<bitfield id="CSEXTRADELAY" width="1" begin="7" end="7" resetval="0x0" description="CS# Add Extra Half GPMC.FCLK cycle 0      CS# Timing control signal is not delayed1      CS# Timing control signal is delayed of       half GPMC.FCLK clock cycle" range="7" rwaccess="R/W"/>
	<bitfield id="RESERVED_44" width="3" begin="6" end="4" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="6:4" rwaccess="R"/>
	<bitfield id="CSONTIME" width="4" begin="3" end="0" resetval="0x1" description="CS# assertion time from start cycle time [0x0 corresponds to 0 GPMC.FCLK cycle, 0x1 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0xF corresponds to 15 GPMC.FCLK cycles]" range="3:0" rwaccess="R/W"/>
	</register><register id="GPMC_CONFIG3_j" acronym="GPMC_CONFIG3_j" offset="104" width="32" description="ADV# signal timing parameter configuration ">
		<bitfield id="RESERVED_1" width="1" begin="31" end="31" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31" rwaccess="R"/>
	<bitfield id="ADVAADMUXWROFFTIME" width="3" begin="30" end="28" resetval="0x2" description="ADV# de-assertion for first address phase when using the AAD-Mux protocol" range="30:28" rwaccess="R/W"/>
	<bitfield id="RESERVED_0" width="1" begin="27" end="27" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="27" rwaccess="R"/>
	<bitfield id="ADVAADMUXRDOFFTIME" width="3" begin="26" end="24" resetval="0x2" description="ADV# assertion for first address phase when using the AAD-Mux protocol" range="26:24" rwaccess="R/W"/>
	<bitfield id="RESERVED_68" width="3" begin="23" end="21" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="23:21" rwaccess="R"/>
	<bitfield id="ADVWROFFTIME" width="5" begin="20" end="16" resetval="0x6" description="ADV# de-assertion time from start cycle time for write accesses [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="20:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_69" width="3" begin="15" end="13" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="15:13" rwaccess="R"/>
	<bitfield id="ADVRDOFFTIME" width="5" begin="12" end="8" resetval="0x5" description="ADV# de-assertion time from start cycle time for read accesses[0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="12:8" rwaccess="R/W"/>
	<bitfield id="ADVEXTRADELAY" width="1" begin="7" end="7" resetval="0x0" description="ADV# Add Extra Half GPMC.FCLK cycle 0      ADV# Timing control signal is not delayed1      ADV# Timing control signal is delayed of       half GPMC.FCLK clock cycle" range="7" rwaccess="R/W"/>
	<bitfield id="ADVAADMUXONTIME" width="3" begin="6" end="4" resetval="0x1" description="ADV# assertion for first address phase when using the AAD-Mux protocol" range="6:4" rwaccess="R/W"/>
	<bitfield id="ADVONTIME" width="4" begin="3" end="0" resetval="0x4" description="ADV# assertion time from start cycle time [0x0 corresponds to 0 GPMC.FCLK cycle, 0x1 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0xF corresponds to 15 GPMC.FCLK cycles]" range="3:0" rwaccess="R/W"/>
	</register><register id="GPMC_CONFIG4_j" acronym="GPMC_CONFIG4_j" offset="108" width="32" description="WE# and OE# signals timing parameter configuration ">
		<bitfield id="RESERVED" width="3" begin="31" end="29" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:29" rwaccess="R"/>
	<bitfield id="WEOFFTIME" width="5" begin="28" end="24" resetval="0x16" description="WE# de-assertion time from start cycle time [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="28:24" rwaccess="R/W"/>
	<bitfield id="WEEXTRADELAY" width="1" begin="23" end="23" resetval="0x0" description="WE# Add Extra Half GPMC.FCLK cycle 0      WE# Timing control signal is not delayed1      WE# Timing control signal is delayed of       half GPMC.FCLK clock cycle" range="23" rwaccess="R/W"/>
	<bitfield id="RESERVED_92" width="3" begin="22" end="20" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="22:20" rwaccess="R"/>
	<bitfield id="WEONTIME" width="4" begin="19" end="16" resetval="0x5" description="WE# assertion time from start cycle time [0x0 corresponds to 0 GPMC.FCLK cycle, 0x1 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0xF corresponds to 15 GPMC.FCLK cycles]" range="19:16" rwaccess="R/W"/>
	<bitfield id="OEAADMUXOFFTIME" width="3" begin="15" end="13" resetval="0x3" description="OE# de-assertion time for the first address phase in an AAD-Mux access" range="15:13" rwaccess="R/W"/>
	<bitfield id="OEOFFTIME" width="5" begin="12" end="8" resetval="0x16" description="OE# de-assertion time from start cycle time [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="12:8" rwaccess="R/W"/>
	<bitfield id="OEEXTRADELAY" width="1" begin="7" end="7" resetval="0x0" description="OE# Add Extra Half GPMC.FCLK cycle 0      OE# Timing control signal is not delayed1      OE# Timing control signal is delayed of       half GPMC.FCLK clock cycle" range="7" rwaccess="R/W"/>
	<bitfield id="OEAADMUXONTIME" width="3" begin="6" end="4" resetval="0x1" description="OE# assertion time for the first address phase in an AAD-Mux access" range="6:4" rwaccess="R/W"/>
	<bitfield id="OEONTIME" width="4" begin="3" end="0" resetval="0x6" description="OE# assertion time from start cycle time [0x0 corresponds to 0 GPMC.FCLK cycle, 0x1 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0xF corresponds to 15 GPMC.FCLK cycles]" range="3:0" rwaccess="R/W"/>
	</register><register id="GPMC_CONFIG5_j" acronym="GPMC_CONFIG5_j" offset="112" width="32" description="RdAccessTime and CycleTime timing parameters configuration ">
		<bitfield id="RESERVED_124" width="4" begin="31" end="28" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:28" rwaccess="R"/>
	<bitfield id="PAGEBURSTACCESSTIME" width="4" begin="27" end="24" resetval="0x1" description="Delay between successive words in a multiple access [0x0 corresponds to 0 GPMC.FCLK cycle, 0x1 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0xF corresponds to 15 GPMC.FCLK cycles]" range="27:24" rwaccess="R/W"/>
	<bitfield id="RESERVED_125" width="3" begin="23" end="21" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="23:21" rwaccess="R"/>
	<bitfield id="RDACCESSTIME" width="5" begin="20" end="16" resetval="0x15" description="Delay between start cycle time and first data valid  [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="20:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_126" width="3" begin="15" end="13" resetval="0x0" description="Write 0's for future compatibility Reads returns 0" range="15:13" rwaccess="R"/>
	<bitfield id="WRCYCLETIME" width="5" begin="12" end="8" resetval="0x17" description="Total write cycle time [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="12:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_123" width="3" begin="7" end="5" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="7:5" rwaccess="R"/>
	<bitfield id="RDCYCLETIME" width="5" begin="4" end="0" resetval="0x17" description="Total read cycle time [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="4:0" rwaccess="R/W"/>
	</register><register id="GPMC_CONFIG6_j" acronym="GPMC_CONFIG6_j" offset="116" width="32" description="WrAccessTime, WrDataOnADmuxBus, Cycle2Cycle and BusTurnAround parameters configuration ">
		<bitfield id="RESERVED" width="1" begin="31" end="31" resetval="0x1" description="TI Internal use - Do not modify" range="31" rwaccess="R/W"/>
