ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/GPMC_GPMC_48400000h.xml
	<bitfield id="RESERVED_0" width="2" begin="30" end="29" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="30:29" rwaccess="R"/>
	<bitfield id="WRACCESSTIME" width="5" begin="28" end="24" resetval="0x15" description="Delay from StartAccessTime to the GPMC.FCLK rising edge corresponding the the GPMC.CLK rising edge used by the attached memory for the first data capture [0x00 corresponds to 0 GPMC.FCLK cycle, 0x01 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0x1F corresponds to 31 GPMC.FCLK cycles]" range="28:24" rwaccess="R/W"/>
	<bitfield id="RESERVED_155" width="4" begin="23" end="20" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="23:20" rwaccess="R"/>
	<bitfield id="WRDATAONADMUXBUS" width="4" begin="19" end="16" resetval="0x7" description="Specifies on which GPMC.FCLK rising edge the first data of the synchronous burst write is driven in the add/data mux bus" range="19:16" rwaccess="R/W"/>
	<bitfield id="RESERVED_1" width="4" begin="15" end="12" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="15:12" rwaccess="R"/>
	<bitfield id="CYCLE2CYCLEDELAY" width="4" begin="11" end="8" resetval="0x0" description="Chip select high pulse delay between two successive accesses [0x0 corresponds to 0 GPMC.FCLK cycle, 0x1 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0xF corresponds to 15 GPMC.FCLK cycles]" range="11:8" rwaccess="R/W"/>
	<bitfield id="CYCLE2CYCLESAMECSEN" width="1" begin="7" end="7" resetval="0x0" description="Add Cycle2CycleDelay between two successive accesses to the same chip-select [any access type] 0      No delay between the two accesses1      Add Cycle2CycleDelay" range="7" rwaccess="R/W"/>
	<bitfield id="CYCLE2CYCLEDIFFCSEN" width="1" begin="6" end="6" resetval="0x0" description="Add Cycle2CycleDelay between two successive accesses to a different chip-select [any access type] 0      No delay between the two accesses1      Add Cycle2CycleDelay" range="6" rwaccess="R/W"/>
	<bitfield id="RESERVED_156" width="2" begin="5" end="4" resetval="0x0" description="Write 0's for future compatibility Reads returns 0" range="5:4" rwaccess="R"/>
	<bitfield id="BUSTURNAROUND" width="4" begin="3" end="0" resetval="0x0" description="Bus turn around latency between two successive accesses to the same chip-select [rd to wr] or to a different chip-select [read to read and read to write] [0x0 corresponds to 0 GPMC.FCLK cycle, 0x1 corresponds to 1 GPMC.FCLK cycle,  &#38;, 0xF corresponds to 15 GPMC.FCLK cycles]" range="3:0" rwaccess="R/W"/>
	</register><register id="GPMC_CONFIG7_j" acronym="GPMC_CONFIG7_j" offset="120" width="32" description="Chip-select address mapping configuration   Note: For CS0, the register reset is 0xf40 while for all the other instances CS1-CS7, the reset is 0xf00.">
		<bitfield id="RESERVED_171" width="20" begin="31" end="12" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="31:12" rwaccess="R"/>
	<bitfield id="MASKADDRESS" width="4" begin="11" end="8" resetval="0x15" description="Chip-select mask address" range="11:8" rwaccess="R/W"/>
	<bitfield id="RESERVED_172" width="1" begin="7" end="7" resetval="0x0" description="Write 0's for future compatibility. Read returns 0" range="7" rwaccess="R"/>
	<bitfield id="CSVALID" width="1" begin="6" end="6" resetval="0x1" description="Chip-select enable [reset value is 1 for CS0 and 0 for CS1-7] 0      Chip-select disabled1      Chip-select enabled" range="6" rwaccess="R/W"/>
	<bitfield id="BASEADDRESS" width="6" begin="5" end="0" resetval="0x0" description="Chip-select base address" range="5:0" rwaccess="R/W"/>
	</register><register id="GPMC_NAND_COMMAND_j" acronym="GPMC_NAND_COMMAND_j" offset="124" width="32" description="This Register is not a true register, just a address location. ">
		<bitfield id="GPMC_NAND_COMMAND_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31:0" rwaccess="W"/>
	</register><register id="GPMC_NAND_ADDRESS_j" acronym="GPMC_NAND_ADDRESS_j" offset="128" width="32" description="This Register is not a true register, just a address location. ">
		<bitfield id="GPMC_NAND_ADDRESS_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31:0" rwaccess="W"/>
	</register><register id="GPMC_NAND_DATA_j" acronym="GPMC_NAND_DATA_j" offset="132" width="32" description="This Register is not a true register, just a address location. ">
		<bitfield id="GPMC_NAND_DATA_0" width="32" begin="31" end="0" resetval="0x0" description="" range="31:0" rwaccess="R/W"/>
	</register><register id="GPMC_BCH_RESULT_0_j" acronym="GPMC_BCH_RESULT_0_j" offset="576" width="32" description="BCH ECC result, bits 0 to 31">
		<bitfield id="BCH_RESULT_0" width="32" begin="31" end="0" resetval="0x0" description="BCH ECC result, bits 0 to 31" range="31:0" rwaccess="R"/>
	</register><register id="GPMC_BCH_RESULT_1_j" acronym="GPMC_BCH_RESULT_1_j" offset="580" width="32" description="BCH ECC result, bits 32 to 63">
		<bitfield id="BCH_RESULT_1" width="32" begin="31" end="0" resetval="0x0" description="BCH ECC result, bits 32 to 63" range="31:0" rwaccess="R"/>
	</register><register id="GPMC_BCH_RESULT_2_j" acronym="GPMC_BCH_RESULT_2_j" offset="584" width="32" description="BCH ECC result, bits 64 to 95">
		<bitfield id="BCH_RESULT_2" width="32" begin="31" end="0" resetval="0x0" description="BCH ECC result, bits 64 to 95" range="31:0" rwaccess="R"/>
	</register><register id="GPMC_BCH_RESULT_3_j" acronym="GPMC_BCH_RESULT_3_j" offset="588" width="32" description="BCH ECC result, bits 96 to 127">
		<bitfield id="BCH_RESULT_3" width="32" begin="31" end="0" resetval="0x0" description="BCH ECC result, bits 96 to 127" range="31:0" rwaccess="R"/>
	</register><register id="GPMC_BCH_RESULT_4_j" acronym="GPMC_BCH_RESULT_4_j" offset="768" width="32" description="BCH ECC result, bits 128 to 159">
		<bitfield id="BCH_RESULT_4" width="32" begin="31" end="0" resetval="0x0" description="BCH ECC result, bits 128 to 159" range="31:0" rwaccess="R"/>
	</register><register id="GPMC_BCH_RESULT_5_j" acronym="GPMC_BCH_RESULT_5_j" offset="772" width="32" description="BCH ECC result, bits 160 to 191">
		<bitfield id="BCH_RESULT_5" width="32" begin="31" end="0" resetval="0x0" description="BCH ECC result, bits 160 to 191" range="31:0" rwaccess="R"/>
	</register><register id="GPMC_BCH_RESULT_6_j" acronym="GPMC_BCH_RESULT_6_j" offset="776" width="32" description="BCH ECC result, bits 192 to 207">
		<bitfield id="BCH_RESULT_6" width="16" begin="15" end="0" resetval="0x0" description="BCH ECC result, bits 192 to 207" range="15:0" rwaccess="R"/>
	</register>
</module>